Repository: ejaa3/aquarelle
Catalog: po/*.po
Languages: es

source: Aquarelle
es: Acuarela

source: Color scheme application software
es: Software de aplicación de esquemas de colores

source: An experimental color scheme processor focused on theme maintainability.
es: Procesador de esquemas de colores centrado en la mantenibilidad del tema.

source: Features:
es: Características:

source: Generate color schemes quickly (dynamic schemes).
es: Generar esquemas de colores rápidamente (esquemas dinámicos).

source: Design schemes slowly, color by color (static schemes).
es: Diseñar esquemas lentamente, color por color (esquemas estáticos).

source: Dynamic schemes of the same theme can share options.
es: Los esquemas dinámicos de un mismo tema pueden compartir opciones.

source: Arrangements allow reproducing the application of schemes between systems.
es: Los arreglos permiten reproducir la aplicación de esquemas entre sistemas.

source: Maps allow schemes to be adapted to any format.
es: Los mapas permiten adaptar esquemas a cualquier formato.

source: If possible, different schemes can be applied on the same target map.
es: Si es posible, se pueden aplicar diferentes esquemas en el mismo mapa objetivo.

source: Maps can suggest paths to export to.
es: Los mapas pueden sugerir rutas a las que exportar.

source: Paths cannot collide.
es: Las rutas no pueden colisionar.

source: Logs unimaginable errors.
es: Registra errores inimaginables.

source: Among other features.
es: Entre otras características.

source: colors
es: colores

source: palettes
es: paletas

source: themes
es: temas

source: GTK;GNOME;colors;palettes;themes;
es: GTK;GNOME;colores;paletas;temas;

source: Window width
es: Anchura de la ventana

source: Width in pixels of the window when the application was closed and will be used next time.
es: Anchura en píxeles de la ventana cuando se cerró la aplicación y se utilizará la próxima vez.

source: Window height
es: Altura de la ventana

source: Height in pixels of the window when the application was closed and will be used next time.
es: Altura en píxeles de la ventana cuando se cerró la aplicación y se utilizará la próxima vez.

source: Window maximization state
es: Estado de maximización de la ventana

source: Show log pane
es: Mostrar panel de registros

source: Log pane height
es: Altura del panel de registros

source: Height in pixels of the log pane when the application was closed and will be used next time.
es: Anchura en píxeles del panel de registros cuando se cerró la aplicación y se utilizará la próxima vez.

source: Last open view
es: Última vista abierta

source: Show maps pane
es: Mostrar panel de mapas

source: Show themes pane
es: Mostrar panel de temas

source: Filter color schemes by lightness
es: Filtra los esquemas de color por luminosidad

source: Appearance policy
es: Política de apariencia

source: Appearance
es: Apariencia

source: Tuple of three identifier strings to locate the color scheme to use (namespace, theme and scheme).
es: Tupla de tres cadenas identificadoras para localizar el esquema de color a usar (espacio de nombres, tema y esquema).

source: Show mnemonics
es: Mostrar mnemotecnia

source: Show menu
es: Mostrar menú

source: Show log
es: Mostrar registro

source: Clear log
es: Limpiar registro

source: Close window
es: Cerrar ventana

source: Show
es: Mostrar

source: All schemes
es: Todos los esquemas

source: Light schemes
es: Esquemas claros

source: Dark schemes
es: Esquemas oscuros

source: Selected scheme
es: Esquema seleccionado

source: Do not change
es: No cambiar

source: Scheme colors
es: Colores del esquema

source: Lower
es: Inferior

source: Surface color
es: Color de superficie

source: Upper
es: Superior

source: Red
es: Rojo

source: Accent color
es: Color de acento

source: Yellow
es: Amarillo

source: Green
es: Verde

source: Cyan
es: Cian

source: Blue
es: Azul

source: Any
es: Cualquiera

source: CRITICAL
es: CRÍTICO

source: WARNING
es: ADVERTENCIA

source: Unable to read local namespaces path at
es: No se puede leer la ruta de los espacios de nombres locales en

source: Unable to read system namespaces path at
es: No se puede leer la ruta de los espacios de nombres del sistema en

source: Unable to read local namespace entry at
es: No se puede leer la entrada del espacio de nombres local en

source: Unable to read system namespace entry at
es: No se puede leer la entrada del espacio de nombres del sistema en

source: Invalid Unicode directory name for local namespace at
es: Unicode inválido como nombre de directorio para un espacio de nombres local en

source: Invalid Unicode directory name for system namespace at
es: Unicode inválido como nombre de directorio para un espacio de nombres del sistema en

source: Unable to read local namespace {id} from
es: No se puede leer el espacio de nombres local {id} desde

source: Unable to read system namespace {id} from
es: No se puede leer el espacio de nombres del sistema {id} desde

source: Failed to deserialize local namespace {id} from
es: Fallo al deserializar el espacio de nombres local {id} desde

source: Failed to deserialize system namespace {id} from
es: Fallo al deserializar el espacio de nombres del sistema {id} desde

source: No namespace {id} was found
es: No se encontró el espacio de nombres {id}

source: In the local namespace {id}
es: En el espacio de nombres local {id}

source: In the system namespace {id}
es: En el espacio de nombres del sistema {id}

source: Unable to read arrangement {id} from
es: No se puede leer el arreglo {id} desde

source: Unable to read map {id} from
es: No se puede leer el mapa {id} desde

source: Unable to read scheme {id} from
es: No se puede leer el esquema {id} desde

source: Unable to read theme {id} from
es: No se puede leer el tema {id} desde

source: Failed to deserialize arrangement {id} from
es: Fallo al deserializar el arreglo {id} desde

source: Failed to deserialize map {id} from
es: Fallo al deserializar el mapa {id} desde

source: Failed to deserialize scheme {id} from
es: Fallo al deserializar el esquema {id} desde

source: Failed to deserialize theme {id} from
es: Fallo al deserializar el tema {id} desde

source: Arrangement {id} not found
es: No se encontró el arreglo {id}

source: Map {id} not found
es: No se encontró el mapa {id}

source: Scheme {id} not found
es: No se encontró el esquema {id}

source: Theme {id} not found
es: No se encontró el tema {id}

source: The data assigned to option {id} is of type {current} instead of {required}
es: El dato asignado a la opción {id} es de tipo {current} en lugar de {required}

source: Unable to read script for scheme {id} at
es: No se puede leer el guion del esquema {id} en

source: In the script for scheme {id} located at
es: En el guión para el esquema {id} ubicado en

source: Script for scheme {id} returns invalid TOML, located at
es: El guion para el esquema {id} devuelve TOML no válido, ubicado en

source: {id} not found
es: {id} no encontrado

source: Request for {id} failed
es: Solicitud de {id} fallida

source: {first} requires {second}
es: {first} requiere {second}

source: In the theme {id}
es: En el tema {id}

source: Suggested path {id} not found in map {map-id}
es: La ruta sugerida {id} no se encontró en el mapa {map-id}

source: Suggested path {id} not found in map {map-id} at namespace {namespace-id}
es: La ruta sugerida {id} no se encontró en el mapa {map-id} en el espacio de nombres {namespace-id}

source: At map {map_id}, requested by {id}
es: En el mapa {map_id}, solicitado por {id}

source: ZIP error at subdirectory {id} as:
es: Error de ZIP en el subdirectorio {id} como:

source: ZIP error at file {id} as:
es: Error de ZIP en el archivo {id} como:

source: ZIP I/O error at file {id} as:
es: Error de E/S de ZIP en el archivo {id} como:

source: ZIP error: {error}
es: Error de ZIP: {error}

source: Unable to read script located at
es: No se puede leer el guion ubicado en

source: Error in the script located at
es: Error en el guion ubicado en

source: Search
es: Buscar

source: Maximum values for Rhai engine
es: Valores máximos para el motor Rhai

source: Zero means “no limits”
es: Cero significa «sin límites»

source: About this in the Rhai book
es: Acerca de esto en el libro de Rhai

source: Length of strings
es: Longitud de las cadenas

source: Size of arrays
es: Tamaño de los arreglos

source: Size of object maps
es: Tamaño de los mapas de objetos

source: Number of operations
es: Número de operaciones

source: Number of modules
es: Número de módulos

source: Call stack depth
es: Profundidad de la pila de llamadas

source: Expression nesting depth
es: Profundidad de anidamiento de expresiones

source: At global level
es: A nivel global

source: Within function bodies
es: Dentro del cuerpo de las funciones

source: Miscellaneous
es: Misceláneo

source: Print errors in the log panel
es: Imprimir errores en el panel de registros

source: Use this function to test a translation
es: Use esta función para probar una traducción

source: _Scan errors
es: Errores de _escaneo

source: _Cache errors
es: Errores de _cache

source: _Namespace errors
es: Errores de espacio de _nombres

source: _Scheme errors
es: Errores de e_squema

source: _Theme errors
es: Errores de _tema

source: Scheme _listing errors
es: Errores de _listado de esquemas

source: Untranslatable
es: Intraducibles

source: _Rhai errors
es: Errores de Rhai

source: _Do not filter by namespace or theme
es: No _filtrar por espacio de nombres ni tema

source: Shared options
es: Opciones compartidas

source: Bindable to dynamic schemes
es: Vinculables a esquemas dinámicos

source: Boolean
es: Booleano

source: Integer
es: Número entero

source: Decimal number
es: Número decimal

source: Text
es: Texto

source: Color Set
es: Conjunto de colores

source: Color Role
es: Rol de color

source: Like
es: Símil

source: Something went wrong
es: Algo salió mal

source: _Log
es: _Registro

source: Show log (F12)
es: Mostrar registro (F12)

source: Menu (F10)
es: Menú (F10)

source: _Clear Log
es: _Limpiar registro

source: _Keyboard Shortcuts
es: _Atajos de teclado

source: About A_quarelle
es: Ac_erca de Acuarela

source: _All schemes
es: _Todos los esquemas

source: _Light schemes
es: Esquemas _claros

source: _Dark schemes
es: Esquemas _oscuros

source: De_fault scheme
es: Esquema por _defecto

source: _Selected scheme
es: Esquema _seleccionado

source: Do not chan_ge
es: _No cambiar

source: Arrangements
es: Arreglos

source: Themes
es: Temas

source: Settings
es: Ajustes

source: Color schemes designer and adaptor
es: Diseñador y adaptador de esquemas de colores
