Repository: ejaa3/aquarelle
Catalog: doc/po/*.po
Languages: es

source: Summary
es: Resumen

source: Introduction
es: Introducción

source: Namespaces
es: Espacios de nombres

source: Options
es: Opciones

source: Themes and schemes
es: Temas y esquemas

source: Aquarelle is a color scheme processor focused on customization, extensibility and easy maintenance of themes or visual styles. It uses [TOML](https://toml.io) format for configuration and [Rhai](https://rhai.rs/book/ref/index.html) language for scripting.
es: Acuarela es un procesador de esquemas de color enfocado en la personalización, la extensibilidad y el mantenimiento sencillo de temas o estilos visuales. Utiliza el formato [TOML](https://toml.io) para la configuración y el lenguaje [Rhai](https://rhai.rs/book/ref/index.html) para las secuencias de comandos.

source: Run `aquarelle` in your terminal with [truecolor support](https://github.com/termstandard/colors?tab=readme-ov-file#truecolor-support-in-output-devices) to see its usage.
es: Ejecute `aquarelle` en su terminal con [soporte de truecolor](https://github.com/termstandard/colors?tab=readme-ov-file#truecolor-support-in-output-devices) para ver su uso.

source: Background
es: Trasfondo

source: There are applications and even documents that allow you to set their appearance using configuration files, but their formats are usually incompatible. So if a theme developer wanted to implement 10 color palettes across 5 different apps, they would end up maintaining about 50 incompatible configurations (10 × 5).
es: Existen aplicaciones e incluso documentos que permiten establecer su aspecto mediante archivos de configuración, pero usualmente sus formatos son incompatibles. Entonces, si un desarrollador de temas quisiera implementar 10 paletas de colores en 5 aplicaciones distintas, terminaría manteniendo unas 50 configuraciones incompatibles (10 × 5).

source: Aquarelle aims to abstract primarily, but not exclusively, color palettes from incompatible application configurations to avoid unnecessary maintenance, so that in the example above the developer would only have to maintain about 15 general configurations (10 + 5) from which the 50 specific configurations would be automatically derived.
es: Acuarela pretende abstraer principalmente, mas no exclusivamente, las paletas de colores desde las configuraciones aplicativas incompatibles para evitar el mantenimiento innecesario, de tal manera que en el ejemplo anterior el desarrollador solo tendría que mantener unas 15 configuraciones generales (10 + 5) de las cuales se derivarían automáticamente las 50 configuraciones específicas.

source: For the above purpose, Aquarelle divides the work into the following items:
es: Para el propósito anterior, Acuarela divide el trabajo en los siguientes elementos:

source: **[Theme](themes.md):** is a collection of color schemes.
es: __[Tema](themes.md):__ es una colección de esquemas de color.

source: **Scheme:** is a parametric color scheme.
es: __Esquema:__ es un esquema de color paramétrico.

source: **Map:** is a configuration that prescribes how to apply a scheme.
es: __Mapa:__ es una configuración que prescribe cómo aplicar un esquema.

source: **Arrangement:** is a choice of schemes to apply and the maps that apply them.
es: __Arreglo:__ es una elección de esquemas a aplicar y los mapas que lo aplican.

source: **[Namespace](namespace.md):** is a collection of all of the above.
es: __[Espacio de nombres](namespace.md):__ es una colección de todo lo anterior.

source: Extensibility
es: Extensibilidad

source: The above items are simple manifest files that extend Aquarelle, and they all share the following [keys](https://toml.io/en/v1.0.0#keyvalue-pair):
es: Los elementos anteriores son simples archivos de manifiesto que extienden a Acuarela, y todas comparten las siguientes [claves](https://toml.io/en/v1.0.0#keyvalue-pair):

source: `name`: short text that could be displayed in a user interface to refer to the item. It should look like the item ID, which is the directory name for a namespace, or a key defined in the namespace manifest for other items.
es: `name`: texto breve que podría mostrarse en una interfaz de usuario para hacer referencia al elemento. Debería parecerse al ID del elemento, que es el nombre del directorio para un espacio de nombres, o una clave definida en el manifiesto del espacio de nombres para otros elementos.

source: `about`: short description that could be displayed in a user interface as additional information. If documentation should be read before using the item, it should be referenced with a hyperlink here.
es: `about`: descripción breve que podría mostrarse en una interfaz de usuario como información adicional. Si se debe leer alguna documentación antes de usar el elemento, debería referirse a ella con un hipervínculo aquí.

source: The following chapters show the specific keys for each element.
es: Los siguientes capítulos muestran las claves específicas para cada elemento.

source: A namespace indexes a collection of themes, schemes, maps or arrangements. They are located in a user-modifiable path, or in an operating system path managed by a software manager.
es: Un espacio de nombres indexa una colección de temas, esquemas, mapas o arreglos. Se ubican en una ruta modificable por el usuario, o en una ruta del sistema operativo administrado por un gestor de software.

source: To list available namespaces, as well as predefined user and system paths, run:
es: Para enumerar los espacios de nombres disponibles, como también las rutas predefinidas del usuario o del sistema, ejecute:

source: Creation and structure
es: Creación y estructura

source: To define a new namespace you can create a directory in the user's path with a manifest file named `Aquarelle.toml`, whose structure consists of the following tables: `themes`, `schemes`, `maps` and `arrangements`.
es: Para definir un nuevo espacio de nombres puede crear un directorio en la ruta del usuario con un archivo de manifiesto nombrado `Aquarelle.toml`, cuya estructura consiste en las siguientes tablas: `themes` (temas), `schemes` (esquemas), `maps` (mapas) y `arrangements` (arreglos).

source: In the contents of each table, keys identify new items and their values ​​can be relative paths to their manifest files.[^value] For example:
es: En el contenido de cada tabla, las claves identifican nuevos elementos y sus valores pueden ser rutas relativas a sus archivos de manifiesto.[^value] Por ejemplo:

source: <sup>**NOTE:** Keys in quotes indicate IDs. You decide how to identify an item.</sup>
es: <sup>__NOTA:__ Las claves entre comillas indican identificaciones. Usted decide cómo identificar un elemento.</sup>

source: If the namespace directory is named `personal-test`, then according to that example manifest it should have the following contents:
es: Si el directorio del espacio de nombres se llama `personal-test`, entonces según ese manifiesto de ejemplo debería tener el siguiente contenido:

source: The namespace ID is its directory name. Aquarelle comes with its own namespace identified as `aquarelle`.
es: La identificación del espacio de nombres es el nombre de su directorio. Acuarela viene con su propio espacio de nombres identificado como `aquarelle`.

source: To check that your namespace is error-free, run the command at the beginning, but note that the command does not check that the indexed files exist.
es: Para comprobar que su espacio de nombres no tiene errores, ejecute el comando en el principio, pero tenga en cuenta que el comando no comprueba que los archivos indexados existan.

source: Values ​​can also be manifest, so there is no need to specify paths to external manifest files, but they would be more verbose. E.g. a scheme name would be defined as `schemes.'my-scheme'.name = 'My Scheme'` instead of `name = 'My Scheme'` in an external file.
es: Los valores también pueden ser manifiestos, por lo que no es necesario especificar rutas a archivos de manifiesto externos, pero serían más verbosos. P. ej. el nombre de un esquema se definiría como `schemes.'my-scheme'.name = 'My Scheme'` en vez de `name = 'My Scheme'` en un archivo externo.

source: Maps and parametric schemes can have optional values, meaning they can be modified in the arrangement or theme that requests them. Values ​​can be:
es: Los mapas y los esquemas paramétricos pueden tener valores opcionales, es decir que pueden modificarse en el arreglo o tema que los solicite. Los valores pueden ser:

source: [Booleans](https://toml.io/en/v1.0.0#boolean), that is, `true` or `false`.
es: [Booleanos](https://toml.io/en/v1.0.0#boolean), o sea `true` o `false`.

source: [Integers](https://toml.io/en/v1.0.0#integer), such as `12` or `24`.
es: [Números enteros](https://toml.io/en/v1.0.0#integer), como `12` o `24`.

source: [Floating-point numbers](https://toml.io/en/v1.0.0#float), such as `12.0` or `24.0`.
es: [Números de coma flotante](https://toml.io/en/v1.0.0#float), como `12.0` o `24.0`.

source: [Text strings](https://toml.io/en/v1.0.0#string), such as `'this string'`.
es: [Cadenas de texto](https://toml.io/en/v1.0.0#string), como `'esta cadena'`.

source: Accent colors, such as `{ accent = 'red' }`.
es: Colores de acento, como `{ accent = 'red' }`.

source: You can define options in your map or parametric scheme by adding keys to an `options` table, whose values consist of a table with the keys `name` and `about` [as in the introduction](index.md#extensibility), and a `default` key whose value will not only be the default value of the option (without a default value, the option would not be optional), but also that the value determines its data type. For example:
es: Puede definir opciones en su mapa o esquema paramétrico añadiendo claves en una tabla `options`, cuyos valores consisten en una tabla con las claves `name` y `about` [como en la introducción](index.md#extensibility), y una clave `default` cuyo valor no solo será el valor por defecto de la opción (sin un valor por defecto, la opción no sería opcional), sino también que el valor determina su tipo de dato. Por ejemplo:

source: You can get the optional values ​​in your script as follows:
es: Puede obtener los valores opcionales en su script de la siguiente manera:

source: You can see that the accent color is just a string, so you can use it as an index:
es: Puede ver que el color de acento es solo una cadena, de modo pueda usarlo como índice:

source: Modifying options
es: Modificando opciones

source: Options are modified by an `options` table, whose keys identify the options defined in the map or parametric scheme, and whose values ​​modify them (they are of the option data type).
es: Las opciones se modifican mediante una tabla `options`, cuyas claves identifican a las opciones definidas en el mapa o esquema paramétrico, y sus valores los modifican (son del tipo de dato de la opción).

source: For example, to modify the above options:
es: Por ejemplo, para modificar las opciones anteriores:

source: Since parametric schemes can only be requested by themes, their options can only be modified in themes. Likewise, since maps can only be requested by arrangements, their options can only be modified in arrangements.
es: Como los esquemas paramétricos solo pueden ser solicitados por temas, sus opciones solo pueden ser modificadas en los temas. Asimismo, como los mapas solo pueden ser solicitados por arreglos, sus opciones solo pueden ser modificadas en arreglos.

source: Preset values
es: Valores preestablecidos

source: Arrangements and themes can have presets, which can be bound to options in different maps or parametric schemes, so that changing the preset changes the value of the bound options, which is useful for consistency.
es: Los arreglos y los temas pueden tener valores preestablecidos, los cuales pueden vincularse a las opciones en distintos mapas o esquemas paramétricos, de modo que al cambiar el valor preestablecido, el valor de las opciones vinculadas cambia, lo cual es útil para tener consistencia.

source: They are defined in the `presets` table, whose keys identify them and whose values ​​can be of any optional data type. For example, let's say you want to share the same accent color across multiple apps, as well as high contrast. The preset values ​​will be:
es: Se definen en la tabla `presets`, cuyas claves los identifican y cuyos valores pueden ser de cualquier tipo de dato opcional. Por ejemplo, digamos que desea compartir el mismo color de acento en múltiples aplicaciones, así como un alto contraste. Los valores preestablecidos serán:

source: To bind to options, the option value must be a table with the key `bind` whose value is the key of a preset. For example:
es: Para vincularlas a las opciones, el valor de la opción debe ser una tabla con la clave `bind` cuyo valor es la clave de uno preestablecido. Por ejemplo:

source: If the option key is the same as the preset value, you can leave the string empty:
es: Si la clave de la opción es igual que el del valor preestablecido, puede dejar la cadena vacía:

source: TOML allows saving braces (e.g. `color.bind = ''`), which is ideal for inline tables:
es: TOML permite ahorrar llaves (p. ej `color.bind = ''`), lo cual es ideal para tablas en línea:

source: A theme is a collection of color schemes that can be generated from parameters, or manually determined color by color. Each scheme contains 27 colors that are classified into roles and role sets.
es: Un tema es una colección de esquemas de color que pueden ser generadas a partir de parámetros, o manualmente determinadas color por color. Cada esquema contiene 27 colores que se clasifican en roles y conjuntos de roles.

source: The color roles are 3 keys:
es: Los roles de colores son 3 claves:

source: `area`: is the background color of an area.
es: `area` _(área)_: es el color de fondo de un área.

source: `text`: is the color of a text over the area, that is, the foreground.
es: `text` _(texto)_: es el color de un texto sobre el área, o sea de primer plano.

source: `like`: is a color like the area, but can be background or foreground.
es: `like` _(cercano)_: es un color como el área, pero puede ser de fondo o primer plano.

source: The main color sets are 2 keys:
es: Los conjuntos de colores principales son 2 claves:

source: `lower`: predominant or basic colors.
es: `lower` _(inferior)_: colores predominantes o básicos.

source: `upper`: colors that sit on the lower ones.
es: `upper` _(superior)_: colores que se asientan sobre los inferiores.

source: The accent color sets are 7 keys: `red`, `yellow`, `green`, `cyan`, `blue`, `magenta` and `any`. In total there are 9 sets; multiplied by the number of roles (3) results in the 27 colors of a scheme.
es: Los conjuntos de colores de acento son 7 claves: `red` _(rojo)_, `yellow` _(amarillo)_, `green` _(verde)_, `cyan` _(cian)_, `blue` _(azul)_, `magenta` _(magenta)_ y `any` _(otro color)_. En total hay 9 conjuntos; multiplicado por el número de roles (3) da como resultado los 27 colores de un esquema.

source: A theme can be created by [indexing](namespaces.md#creation) its TOML manifest into the namespace,[^alt] whose contents consist primarily of the `schemes` table, whose keys identify the theme's schemes, and whose values ​​consist of the `name` key for the scheme name, plus the 9 color set keys.
es: Se puede crear un tema [indexando]((namespaces.md#creation)) su manifiesto TOML en el espacio de nombres,[^alt] cuyo contenido consiste principalmente en la tabla `schemes`, cuyas claves identifican los esquemas del tema, y cuyos valores consisten en la clave `name` para el nombre del esquema, más las 9 claves de los conjuntos de colores.

source: The set value is the 3 color role keys, and the role value is an integer that is interpreted as a color in the sRGB space.
es: El valor de los conjuntos son las 3 claves de los roles de colores, y el valor de los roles es un número entero que se interpreta como un color en el espacio sRGB.

source: For example, let's look at the file structure of the _[Gruvbox](https://github.com/morhetz/gruvbox)_ theme from the `aquarelle` namespace:
es: Por ejemplo, veamos la estructura del archivo del tema _[Gruvbox](https://github.com/morhetz/gruvbox)_ en el espacio de nombres `aquarelle`:

source: In this case, the `gruvbox` theme has two schemes (one light and one dark), and as you can see, it is ideal to write the colors in hexadecimal notation (from 0x00000000 to 0xFFFFFFFF) since every two digits represent the amount of red, green, blue, and alpha or opacity (0xRRGGBBAA), although the normal thing is that they are opaque (AA = FF).
es: En este caso, el tema `gruvbox` tiene dos esquemas (uno claro y otro oscuro), y como puede ver, lo ideal es escribir los colores en notación hexadecimal (desde 0x00000000 hasta 0xFFFFFFFF) ya que cada dos dígitos representan la cantidad de rojo, verde, azul, y alfa u opacidad (0xRRGGBBAA), aunque lo normal es que sean opacos (AA = FF).

source: To display the above schemes, run `aquarelle print`:
es: Para visualizar los esquemas anteriores, ejecute `aquarelle print`:

source: `-f` or `--from` to identify the `aquarelle` namespace.
es: `-f` o `--from` para identificar el espacio de nombres `aquarelle`.

source: `-t` or `--theme` to identify the `gruvbox` theme.
es: `-t` o `--theme` para identificar el tema `gruvbox`.

source: `dark` and `light` identify two schemes to display.[^bg]
es: `dark` y `light` identifican dos esquemas a visualizar.[^bg]

source: It is currently not possible to simulate the display of transparent schemes in terminals.
es: Actualmente no es posible simular la visualización de esquemas transparentes en terminales.

source: Using parametric schemes
es: Usando esquemas paramétricos

source: Unlike the previous schemes, Aquarelle also supports automatically generated schemes when requesting parametric schemes. To do this, the value of the scheme to be generated (identified in the `schemes` table) consists of the keys `request` (required) and `options`.
es: A diferencia de los esquemas anteriores, Acuarela también soporta esquemas generados automáticamente al solicitar esquemas paramétricos. Para ello, el valor del esquema a generar (identificado en la tabla `schemes`) consiste en las claves `request` (obligatorio) y `options`.

source: The value of `request` consists of the key `scheme` (required) which identifies the parametric scheme, and the key `from` which identifies its namespace. If `from` is not present, the requested scheme is assumed to be in the namespace of the requesting theme.
es: El valor de `request` consiste en la clave `scheme` (obligatorio) que identifica el esquema paramétrico, y la clave `from` que identifica su espacio de nombres. Si `from` no está presente, se asume que el esquema solicitado se encuentra en el espacio de nombres del tema solicitante.

source: For example, let's look at a structure similar to the `neon-cake` theme, identified as such in the `aquarelle` namespace, which uses a parametric color scheme with the same ID to generate its schemes:
es: Por ejemplo, veamos una estructura similar al tema `neon-cake`, identificado así en el espacio de nombres `aquarelle`, que utiliza un esquema de color paramétrico con la misma identificación para generar sus esquemas:

source: About the `options` table, see the [options](options.md#modifying) chapter. Themes also support [presets](options.md#presets). Display the schemes with:
es: Sobre la tabla `options`, consulte el capítulo de [opciones](options.md#modifying). Los temas también soportan [valores preestablecidos](options.md#presets). Visualice los esquemas con:

source: Can also be created directly according to a [footnote](namespaces.md#value).
es: También puede crearse directamente según una [nota al pie](namespaces.md#value).

source: You can add `-b` or `--bg` plus a number to change the background color of accent-colored texts in the display. The numbers are:
es: Puede añadir `-b` o `--bg` más un número para cambiar el color de fondo de los textos con color de acento en la visualización. Los números son:

source: `lower.area`: the greatest contrast should be seen.
es: `lower.area` _(área inferior)_: debería verse el mayor contraste.

source: `lower.like`: default value.
es: `lower.like` _(cercano al área inferior)_: valor por defecto.

source: `upper.like`: the least contrast in light schemes.
es: `upper.like` _(parecido al área superior)_: el menor contraste en esquemas claros.

source: `upper.area`: the least contrast in dark schemes.
es: `upper.area` _(área superior)_: el menor contraste en esquemas oscuros.
